Treebank Word Tokenizer
Vocabulary size: 903

> Dictionary:

good: 340
morning: 340
i: 6134
'd: 258
like: 706
to: 2276
book: 514
a: 2988
table: 788
with: 3315
italian: 713
food: 875
in: 2983
paris: 872
for: 5991
six: 971
people: 1173
please: 827
cheap: 1235
price: 1738
range: 1738
actually: 967
would: 1447
prefer: 967
two: 1032
instead: 1051
could: 1051
it: 4579
be: 2196
madrid: 647
spanish: 758
no: 2929
this: 1885
does: 481
not: 481
work: 481
me: 4885
do: 4079
you: 10671
have: 1772
something: 475
else: 2493
's: 482
perfect: 236
may: 791
the: 2791
phone: 755
number: 755
of: 2661
restaurant: 1225
thanks: 851
thank: 827
hello: 1331
love: 420
indian: 669
bombay: 613
four: 923
french: 671
cuisine: 1113
n't: 448
that: 966
hi: 329
moderate: 1267
let: 4650
address: 779
london: 768
british: 683
what: 2650
is: 4798
can: 2733
make: 212
reservation: 1212
expensive: 992
looks: 277
great: 1277
its: 506
rock: 322
rome: 615
eight: 589
am: 250
looking: 744
provide: 265
we: 153
will: 153
help: 2000
today: 1000
'm: 1000
on: 1494
where: 512
should: 512
how: 480
many: 480
your: 480
party: 480
which: 494
are: 494
ok: 2000
look: 2000
into: 2000
some: 2000
options: 2000
api_call: 2000
sure: 3422
there: 3018
anything: 3018
update: 2018
find: 1404
an: 1404
other: 1404
option: 2808
think: 1404
:: 1404
resto_madrid_cheap_spanish_6stars: 14
resto_madrid_cheap_spanish_1stars: 12
here: 1534
resto_madrid_cheap_spanish_1stars_phone: 7
're: 1000
welcome: 1000
any: 494
preference: 494
type: 494
resto_bombay_cheap_french_3stars: 7
resto_bombay_cheap_french_1stars: 4
resto_bombay_cheap_french_1stars_phone: 3
resto_bombay_cheap_french_1stars_address: 2
resto_london_moderate_british_5stars_phone: 3
resto_madrid_expensive_indian_5stars: 5
resto_madrid_expensive_indian_4stars: 5
resto_madrid_expensive_indian_1stars: 3
resto_madrid_expensive_indian_1stars_phone: 1
resto_madrid_expensive_indian_1stars_address: 3
resto_rome_cheap_italian_5stars: 9
resto_rome_cheap_italian_4stars: 6
resto_rome_cheap_italian_4stars_phone: 1
resto_bombay_expensive_indian_4stars: 6
resto_bombay_expensive_indian_2stars: 6
resto_bombay_expensive_indian_2stars_phone: 2
resto_bombay_moderate_indian_2stars: 13
resto_bombay_moderate_indian_1stars: 10
resto_bombay_moderate_indian_1stars_address: 7
resto_madrid_cheap_italian_5stars: 6
resto_madrid_cheap_italian_4stars: 4
resto_madrid_cheap_italian_3stars: 2
resto_madrid_cheap_italian_3stars_address: 2
resto_madrid_cheap_italian_3stars_phone: 2
resto_madrid_cheap_british_8stars_phone: 4
resto_madrid_cheap_british_8stars_address: 4
resto_paris_moderate_british_7stars: 10
resto_paris_moderate_british_7stars_phone: 2
resto_london_expensive_british_8stars_address: 1
resto_london_expensive_british_8stars_phone: 2
resto_paris_moderate_spanish_6stars: 10
resto_paris_moderate_spanish_1stars: 7
resto_paris_moderate_spanish_1stars_address: 5
resto_paris_moderate_spanish_1stars_phone: 5
resto_rome_cheap_italian_3stars: 5
resto_rome_cheap_italian_3stars_address: 4
resto_rome_cheap_italian_3stars_phone: 4
resto_madrid_moderate_indian_5stars: 6
resto_madrid_moderate_indian_2stars: 6
resto_madrid_moderate_indian_2stars_address: 5
resto_paris_cheap_italian_2stars: 10
resto_paris_cheap_italian_2stars_phone: 3
resto_bombay_expensive_italian_8stars_address: 1
resto_bombay_expensive_spanish_8stars_address: 6
resto_paris_cheap_british_5stars: 7
resto_paris_cheap_british_4stars: 6
resto_paris_cheap_british_4stars_address: 5
resto_paris_cheap_british_4stars_phone: 5
resto_london_moderate_british_3stars: 7
resto_london_moderate_british_3stars_phone: 4
resto_london_moderate_british_3stars_address: 4
resto_bombay_cheap_indian_4stars: 13
resto_bombay_cheap_indian_2stars: 12
resto_bombay_cheap_indian_2stars_address: 9
resto_bombay_cheap_indian_2stars_phone: 11
resto_paris_cheap_spanish_2stars: 6
resto_paris_cheap_spanish_1stars: 5
resto_paris_cheap_spanish_1stars_address: 4
resto_paris_expensive_spanish_5stars: 11
resto_paris_expensive_spanish_4stars: 5
resto_paris_expensive_spanish_1stars: 4
resto_paris_expensive_spanish_1stars_phone: 4
resto_paris_expensive_spanish_1stars_address: 1
resto_bombay_cheap_indian_8stars_address: 2
resto_bombay_cheap_french_3stars_phone: 2
resto_london_moderate_french_8stars_phone: 2
resto_london_moderate_french_8stars_address: 3
resto_paris_moderate_indian_5stars: 9
resto_paris_moderate_indian_5stars_address: 3
resto_paris_moderate_indian_5stars_phone: 3
resto_rome_moderate_spanish_8stars_address: 5
resto_rome_moderate_spanish_8stars_phone: 4
resto_paris_expensive_french_7stars: 8
resto_paris_expensive_french_5stars: 8
resto_paris_expensive_french_5stars_address: 3
resto_madrid_cheap_italian_8stars_phone: 2
resto_paris_moderate_spanish_8stars_address: 3
resto_paris_moderate_spanish_8stars_phone: 2
resto_paris_expensive_italian_8stars_phone: 4
resto_paris_expensive_italian_8stars_address: 4
resto_rome_cheap_french_4stars: 5
resto_rome_cheap_french_3stars: 5
resto_rome_cheap_french_3stars_address: 5
resto_rome_cheap_french_3stars_phone: 4
resto_rome_expensive_indian_6stars: 9
resto_rome_expensive_indian_6stars_address: 4
resto_bombay_expensive_italian_8stars_phone: 1
resto_bombay_cheap_french_4stars: 12
resto_bombay_cheap_french_2stars: 11
resto_bombay_cheap_french_2stars_address: 9
resto_paris_moderate_british_8stars_address: 4
resto_paris_moderate_british_8stars_phone: 4
resto_paris_expensive_spanish_7stars: 11
resto_paris_expensive_spanish_7stars_phone: 1
resto_paris_expensive_spanish_7stars_address: 2
resto_madrid_cheap_italian_7stars_phone: 3
resto_madrid_cheap_italian_7stars_address: 2
resto_madrid_moderate_indian_2stars_phone: 5
resto_bombay_moderate_french_5stars: 8
resto_bombay_moderate_french_4stars: 5
resto_bombay_moderate_french_3stars: 4
resto_bombay_moderate_french_3stars_address: 4
resto_bombay_moderate_french_3stars_phone: 3
resto_london_moderate_french_3stars: 8
resto_london_moderate_french_2stars: 6
resto_london_moderate_french_2stars_phone: 4
resto_london_cheap_spanish_8stars_address: 4
resto_bombay_moderate_french_4stars_address: 1
resto_bombay_moderate_indian_3stars_address: 2
resto_madrid_expensive_spanish_5stars: 7
resto_madrid_expensive_spanish_1stars: 5
resto_madrid_expensive_spanish_1stars_phone: 4
resto_madrid_expensive_spanish_1stars_address: 4
resto_rome_moderate_french_6stars: 6
resto_rome_moderate_french_3stars: 6
resto_rome_moderate_french_2stars: 4
resto_rome_moderate_french_2stars_phone: 4
resto_rome_moderate_indian_4stars: 13
resto_rome_moderate_indian_2stars: 9
resto_rome_moderate_indian_2stars_address: 7
resto_bombay_expensive_indian_5stars_address: 1
resto_madrid_expensive_italian_4stars: 12
resto_madrid_expensive_italian_2stars: 8
resto_madrid_expensive_italian_2stars_phone: 6
resto_madrid_expensive_italian_2stars_address: 5
resto_rome_cheap_spanish_8stars_phone: 4
resto_rome_cheap_spanish_8stars_address: 3
resto_paris_cheap_spanish_1stars_phone: 4
resto_london_expensive_spanish_3stars: 5
resto_london_expensive_spanish_1stars: 3
resto_london_expensive_spanish_1stars_address: 3
resto_london_expensive_spanish_1stars_phone: 2
resto_paris_moderate_french_7stars: 9
resto_paris_moderate_french_7stars_address: 5
resto_paris_moderate_french_7stars_phone: 5
resto_london_cheap_british_4stars: 8
resto_london_cheap_british_2stars: 4
resto_london_cheap_british_2stars_phone: 4
resto_london_cheap_british_2stars_address: 4
resto_paris_moderate_spanish_7stars_phone: 1
resto_paris_moderate_spanish_7stars_address: 2
resto_rome_moderate_spanish_4stars_address: 1
resto_rome_moderate_spanish_4stars_phone: 2
resto_paris_moderate_french_5stars: 7
resto_paris_moderate_french_3stars: 3
resto_paris_moderate_french_3stars_phone: 2
resto_rome_cheap_british_7stars_phone: 2
resto_rome_cheap_british_7stars_address: 1
resto_paris_cheap_italian_1stars: 7
resto_paris_cheap_italian_1stars_phone: 5
resto_paris_cheap_italian_1stars_address: 5
resto_london_expensive_indian_2stars: 12
resto_london_expensive_indian_1stars: 10
resto_london_expensive_indian_1stars_address: 8
resto_bombay_expensive_italian_4stars: 10
resto_bombay_expensive_italian_4stars_address: 2
resto_london_cheap_italian_5stars_phone: 6
resto_london_cheap_italian_2stars: 11
resto_london_cheap_italian_2stars_address: 1
resto_paris_cheap_indian_6stars: 10
resto_paris_cheap_indian_6stars_phone: 5
resto_paris_cheap_indian_6stars_address: 4
resto_london_moderate_british_2stars: 3
resto_london_moderate_british_2stars_phone: 3
resto_london_moderate_british_2stars_address: 3
resto_paris_expensive_french_8stars_phone: 3
resto_london_cheap_french_4stars: 18
resto_london_cheap_french_2stars: 14
resto_london_cheap_french_2stars_phone: 11
resto_madrid_cheap_british_5stars_address: 4
resto_madrid_cheap_british_5stars_phone: 4
resto_rome_cheap_italian_5stars_phone: 3
resto_rome_cheap_italian_5stars_address: 2
resto_paris_expensive_italian_4stars: 7
resto_paris_expensive_italian_1stars: 4
resto_paris_expensive_italian_1stars_phone: 3
resto_bombay_moderate_british_5stars: 4
resto_bombay_moderate_british_1stars: 4
resto_bombay_moderate_british_1stars_address: 3
resto_bombay_cheap_indian_8stars_phone: 2
resto_london_cheap_french_2stars_address: 12
resto_bombay_cheap_italian_8stars_address: 3
resto_rome_moderate_indian_2stars_phone: 7
resto_madrid_expensive_french_3stars: 3
resto_madrid_expensive_french_1stars: 2
resto_madrid_expensive_french_1stars_phone: 2
resto_london_expensive_spanish_3stars_phone: 2
resto_rome_expensive_indian_2stars: 5
resto_rome_expensive_indian_1stars: 5
resto_rome_expensive_indian_1stars_address: 3
resto_rome_expensive_indian_1stars_phone: 5
resto_paris_expensive_british_4stars: 10
resto_paris_expensive_british_3stars: 6
resto_paris_expensive_british_2stars: 5
resto_paris_expensive_british_2stars_address: 5
resto_paris_expensive_british_2stars_phone: 4
resto_london_cheap_italian_1stars: 9
resto_london_cheap_italian_1stars_phone: 9
resto_london_cheap_italian_1stars_address: 7
resto_paris_cheap_indian_7stars_phone: 3
resto_paris_cheap_indian_7stars_address: 2
resto_bombay_expensive_indian_5stars_phone: 1
resto_bombay_cheap_french_8stars_address: 1
resto_bombay_cheap_french_8stars_phone: 1
resto_bombay_moderate_spanish_6stars: 8
resto_bombay_moderate_spanish_6stars_phone: 2
resto_bombay_moderate_spanish_6stars_address: 3
resto_madrid_moderate_british_4stars: 12
resto_madrid_moderate_british_2stars: 10
resto_madrid_moderate_british_2stars_phone: 8
resto_london_cheap_spanish_7stars: 8
resto_london_cheap_spanish_4stars: 6
resto_london_cheap_spanish_4stars_phone: 4
resto_london_cheap_spanish_4stars_address: 5
resto_rome_expensive_italian_4stars_address: 4
resto_rome_expensive_italian_4stars_phone: 3
resto_bombay_expensive_spanish_5stars: 7
resto_bombay_expensive_spanish_2stars: 6
resto_bombay_expensive_spanish_1stars: 2
resto_bombay_expensive_spanish_1stars_phone: 2
resto_london_moderate_indian_8stars_phone: 2
resto_london_moderate_indian_8stars_address: 1
resto_london_expensive_british_3stars: 5
resto_london_expensive_british_2stars: 3
resto_london_expensive_british_2stars_address: 2
resto_rome_moderate_french_7stars_address: 6
resto_rome_moderate_french_7stars_phone: 4
resto_paris_moderate_spanish_5stars: 13
resto_paris_moderate_spanish_4stars: 11
resto_paris_moderate_spanish_4stars_phone: 3
resto_madrid_cheap_italian_6stars: 10
resto_madrid_cheap_italian_2stars: 7
resto_madrid_cheap_italian_2stars_phone: 4
resto_madrid_expensive_spanish_6stars_address: 3
resto_rome_moderate_spanish_7stars: 4
resto_rome_moderate_spanish_6stars: 4
resto_rome_moderate_spanish_6stars_address: 1
resto_rome_moderate_spanish_6stars_phone: 1
resto_london_expensive_french_5stars: 9
resto_london_expensive_french_3stars: 5
resto_london_expensive_french_1stars: 4
resto_london_expensive_french_1stars_address: 3
resto_london_expensive_french_1stars_phone: 3
resto_rome_cheap_spanish_6stars: 8
resto_rome_cheap_spanish_4stars: 6
resto_rome_cheap_spanish_3stars: 4
resto_rome_cheap_spanish_3stars_address: 4
resto_rome_cheap_spanish_3stars_phone: 4
resto_madrid_cheap_french_7stars: 6
resto_madrid_cheap_french_5stars: 2
resto_madrid_cheap_french_5stars_address: 2
resto_madrid_cheap_french_5stars_phone: 2
resto_madrid_cheap_british_7stars: 5
resto_madrid_cheap_british_6stars: 4
resto_madrid_cheap_british_6stars_address: 1
resto_rome_moderate_italian_5stars: 11
resto_rome_moderate_italian_4stars: 8
resto_rome_moderate_italian_4stars_address: 6
resto_rome_moderate_italian_4stars_phone: 5
resto_paris_expensive_spanish_8stars_phone: 3
resto_paris_expensive_spanish_8stars_address: 1
resto_london_expensive_indian_1stars_phone: 5
resto_paris_moderate_french_5stars_address: 4
resto_paris_moderate_french_5stars_phone: 3
resto_london_expensive_british_3stars_address: 2
resto_london_expensive_british_3stars_phone: 2
resto_paris_moderate_spanish_6stars_address: 3
resto_paris_moderate_spanish_6stars_phone: 1
resto_bombay_cheap_indian_5stars: 7
resto_bombay_cheap_indian_3stars: 7
resto_bombay_cheap_indian_3stars_address: 7
resto_paris_expensive_british_4stars_phone: 3
resto_paris_expensive_british_4stars_address: 2
resto_paris_cheap_indian_3stars: 5
resto_paris_cheap_indian_3stars_phone: 3
resto_paris_cheap_indian_3stars_address: 4
resto_madrid_moderate_french_6stars: 10
resto_madrid_moderate_french_4stars: 7
resto_madrid_moderate_french_2stars: 7
resto_madrid_moderate_french_2stars_phone: 7
resto_rome_moderate_indian_5stars: 12
resto_rome_moderate_indian_3stars: 10
resto_rome_moderate_indian_1stars: 8
resto_rome_moderate_indian_1stars_phone: 8
resto_rome_moderate_indian_1stars_address: 5
resto_paris_moderate_french_6stars_phone: 2
resto_madrid_cheap_spanish_6stars_address: 1
resto_madrid_cheap_spanish_6stars_phone: 2
resto_madrid_moderate_british_5stars: 9
resto_madrid_moderate_british_1stars: 6
resto_madrid_moderate_british_1stars_address: 6
resto_rome_expensive_spanish_6stars: 10
resto_rome_expensive_spanish_2stars: 8
resto_rome_expensive_spanish_2stars_address: 5
resto_rome_expensive_spanish_2stars_phone: 7
resto_london_moderate_spanish_8stars_phone: 2
resto_london_moderate_spanish_8stars_address: 2
resto_paris_moderate_italian_5stars: 8
resto_paris_moderate_italian_5stars_phone: 1
resto_paris_moderate_italian_5stars_address: 1
resto_rome_moderate_british_4stars: 3
resto_rome_moderate_british_4stars_phone: 1
resto_rome_moderate_british_4stars_address: 1
resto_paris_cheap_british_7stars_address: 1
resto_paris_cheap_british_7stars_phone: 2
resto_paris_expensive_spanish_5stars_phone: 5
resto_rome_moderate_indian_5stars_phone: 2
resto_rome_moderate_indian_5stars_address: 2
resto_paris_moderate_british_6stars: 6
resto_paris_moderate_british_6stars_phone: 4
resto_paris_moderate_british_6stars_address: 5
resto_rome_moderate_italian_3stars: 2
resto_rome_moderate_italian_2stars: 2
resto_rome_moderate_italian_2stars_phone: 2
resto_rome_moderate_italian_2stars_address: 2
resto_madrid_cheap_french_7stars_phone: 4
resto_madrid_cheap_french_7stars_address: 4
resto_bombay_cheap_french_3stars_address: 2
resto_rome_expensive_british_5stars: 4
resto_rome_expensive_british_2stars: 2
resto_rome_expensive_british_2stars_phone: 2
resto_paris_moderate_british_7stars_address: 3
resto_bombay_moderate_italian_7stars_phone: 3
resto_bombay_moderate_italian_7stars_address: 4
resto_paris_moderate_french_8stars_address: 5
resto_madrid_moderate_italian_6stars: 9
resto_madrid_moderate_italian_4stars: 7
resto_madrid_moderate_italian_4stars_address: 5
resto_bombay_expensive_spanish_2stars_address: 3
resto_bombay_expensive_spanish_2stars_phone: 2
resto_madrid_moderate_french_3stars: 9
resto_madrid_moderate_french_1stars: 7
resto_madrid_moderate_french_1stars_address: 6
resto_paris_moderate_french_2stars: 4
resto_paris_moderate_french_2stars_address: 4
resto_paris_moderate_french_2stars_phone: 4
resto_rome_moderate_british_8stars_address: 2
resto_rome_moderate_british_8stars_phone: 2
resto_rome_cheap_spanish_6stars_phone: 1
resto_rome_cheap_spanish_6stars_address: 2
resto_paris_cheap_british_8stars_address: 2
resto_bombay_cheap_italian_4stars: 10
resto_bombay_cheap_italian_3stars: 6
resto_bombay_cheap_italian_2stars: 5
resto_bombay_cheap_italian_1stars: 4
resto_bombay_cheap_italian_1stars_address: 3
resto_bombay_cheap_italian_1stars_phone: 4
resto_madrid_moderate_french_8stars_phone: 4
resto_madrid_moderate_french_8stars_address: 3
resto_paris_expensive_french_4stars: 4
resto_paris_expensive_french_2stars: 4
resto_paris_expensive_french_1stars: 3
resto_paris_expensive_french_1stars_address: 3
resto_paris_expensive_french_1stars_phone: 2
resto_bombay_moderate_spanish_8stars_address: 2
resto_rome_moderate_british_2stars: 2
resto_rome_moderate_british_2stars_address: 2
resto_bombay_cheap_indian_3stars_phone: 4
resto_london_expensive_spanish_6stars_address: 3
resto_london_expensive_french_5stars_phone: 4
resto_bombay_moderate_indian_1stars_phone: 7
resto_rome_cheap_british_5stars: 6
resto_rome_cheap_british_4stars: 5
resto_rome_cheap_british_1stars: 3
resto_rome_cheap_british_1stars_phone: 3
resto_rome_cheap_british_1stars_address: 3
resto_madrid_cheap_italian_6stars_address: 3
resto_rome_moderate_indian_4stars_address: 2
resto_rome_moderate_indian_4stars_phone: 4
resto_madrid_expensive_indian_4stars_phone: 1
resto_madrid_expensive_indian_4stars_address: 2
resto_madrid_cheap_british_4stars: 4
resto_madrid_cheap_british_4stars_address: 1
resto_madrid_cheap_british_4stars_phone: 1
resto_bombay_cheap_spanish_7stars: 2
resto_bombay_cheap_spanish_6stars: 1
resto_bombay_cheap_spanish_5stars: 1
resto_bombay_cheap_spanish_1stars: 1
resto_bombay_cheap_spanish_1stars_phone: 1
resto_london_cheap_spanish_7stars_address: 2
resto_paris_moderate_italian_6stars_phone: 4
resto_london_moderate_indian_5stars: 7
resto_london_moderate_indian_4stars: 6
resto_london_moderate_indian_4stars_phone: 4
resto_london_moderate_indian_4stars_address: 4
resto_bombay_expensive_italian_2stars: 8
resto_bombay_expensive_italian_1stars: 6
resto_bombay_expensive_italian_1stars_phone: 4
resto_bombay_expensive_italian_1stars_address: 5
resto_rome_moderate_french_3stars_address: 1
resto_rome_moderate_french_3stars_phone: 2
resto_paris_moderate_spanish_3stars: 8
resto_paris_moderate_spanish_3stars_address: 8
resto_paris_cheap_british_6stars: 10
resto_paris_cheap_british_2stars: 8
resto_paris_cheap_british_2stars_phone: 5
resto_madrid_expensive_british_6stars: 2
resto_madrid_expensive_british_1stars: 2
resto_madrid_expensive_british_1stars_phone: 2
resto_paris_moderate_french_8stars_phone: 4
resto_paris_cheap_british_2stars_address: 6
resto_bombay_expensive_british_5stars: 6
resto_bombay_expensive_british_3stars: 4
resto_bombay_expensive_british_2stars: 3
resto_bombay_expensive_british_2stars_address: 3
resto_bombay_expensive_british_2stars_phone: 3
resto_london_expensive_french_5stars_address: 3
resto_bombay_cheap_french_2stars_phone: 7
resto_madrid_moderate_indian_7stars_phone: 4
resto_paris_expensive_indian_4stars: 8
resto_paris_expensive_indian_3stars: 6
resto_paris_expensive_indian_2stars: 4
resto_paris_expensive_indian_1stars: 4
resto_paris_expensive_indian_1stars_phone: 4
resto_paris_expensive_indian_1stars_address: 3
resto_paris_moderate_italian_2stars: 7
resto_paris_moderate_italian_2stars_phone: 7
resto_paris_moderate_italian_2stars_address: 3
resto_london_cheap_italian_8stars_phone: 2
resto_london_cheap_italian_8stars_address: 2
resto_paris_moderate_indian_1stars: 6
resto_paris_moderate_indian_1stars_address: 5
resto_london_cheap_italian_6stars: 3
resto_london_cheap_italian_4stars: 2
resto_london_cheap_italian_4stars_address: 2
resto_madrid_moderate_british_1stars_phone: 1
resto_bombay_moderate_french_6stars_address: 3
resto_bombay_moderate_french_7stars: 13
resto_bombay_moderate_french_1stars: 12
resto_bombay_moderate_french_1stars_address: 9
resto_bombay_moderate_french_1stars_phone: 9
resto_paris_expensive_indian_4stars_address: 2
resto_paris_expensive_indian_4stars_phone: 2
resto_paris_cheap_spanish_8stars_address: 3
resto_paris_cheap_spanish_8stars_phone: 5
resto_paris_moderate_spanish_5stars_address: 2
resto_bombay_cheap_indian_7stars_phone: 2
resto_rome_expensive_spanish_7stars_address: 2
resto_paris_cheap_spanish_2stars_address: 1
resto_paris_expensive_italian_1stars_address: 3
resto_madrid_moderate_british_2stars_address: 8
resto_london_cheap_british_3stars: 8
resto_london_cheap_british_3stars_phone: 4
resto_bombay_cheap_italian_4stars_address: 4
resto_london_moderate_british_8stars_address: 1
resto_london_moderate_british_8stars_phone: 1
resto_rome_expensive_indian_8stars_address: 2
resto_rome_expensive_indian_8stars_phone: 2
resto_rome_cheap_indian_6stars: 8
resto_rome_cheap_indian_5stars: 4
resto_rome_cheap_indian_5stars_phone: 4
resto_bombay_moderate_indian_2stars_phone: 3
resto_bombay_moderate_indian_2stars_address: 3
resto_madrid_cheap_indian_5stars: 7
resto_madrid_cheap_indian_5stars_phone: 3
resto_madrid_cheap_indian_5stars_address: 2
resto_paris_expensive_french_5stars_phone: 3
resto_rome_moderate_italian_7stars_address: 5
resto_rome_moderate_italian_7stars_phone: 3
resto_madrid_expensive_british_8stars_address: 2
resto_madrid_moderate_italian_4stars_phone: 5
resto_madrid_moderate_indian_7stars_address: 4
resto_paris_moderate_indian_1stars_phone: 5
resto_paris_expensive_spanish_3stars: 9
resto_paris_expensive_spanish_3stars_phone: 5
resto_paris_expensive_spanish_3stars_address: 7
resto_london_moderate_british_6stars: 4
resto_london_moderate_british_4stars: 3
resto_london_moderate_british_4stars_phone: 1
resto_rome_moderate_spanish_5stars: 3
resto_rome_moderate_spanish_5stars_phone: 3
resto_rome_cheap_spanish_4stars_phone: 2
resto_rome_cheap_spanish_4stars_address: 2
resto_madrid_moderate_italian_6stars_phone: 2
resto_paris_moderate_british_2stars: 8
resto_paris_moderate_british_1stars: 7
resto_paris_moderate_british_1stars_address: 5
resto_madrid_expensive_french_1stars_address: 1
resto_london_moderate_french_2stars_address: 5
resto_bombay_expensive_british_5stars_address: 2
resto_bombay_expensive_british_5stars_phone: 2
resto_paris_expensive_indian_3stars_phone: 2
resto_paris_expensive_indian_3stars_address: 2
resto_paris_moderate_spanish_3stars_phone: 5
resto_london_moderate_indian_3stars_address: 2
resto_london_moderate_indian_3stars_phone: 3
resto_madrid_cheap_spanish_1stars_address: 8
resto_paris_cheap_british_5stars_phone: 1
resto_paris_cheap_british_5stars_address: 1
resto_paris_cheap_spanish_6stars: 6
resto_paris_cheap_spanish_4stars: 5
resto_paris_cheap_spanish_4stars_address: 5
resto_london_cheap_french_4stars_address: 4
resto_london_cheap_french_4stars_phone: 2
resto_london_expensive_spanish_5stars: 8
resto_london_expensive_spanish_4stars: 8
resto_london_expensive_spanish_4stars_phone: 7
resto_london_expensive_spanish_4stars_address: 5
resto_madrid_cheap_indian_1stars: 4
resto_madrid_cheap_indian_1stars_address: 4
resto_madrid_cheap_indian_1stars_phone: 3
resto_madrid_moderate_french_1stars_phone: 2
resto_madrid_cheap_italian_2stars_address: 5
resto_madrid_moderate_french_2stars_address: 5
resto_rome_expensive_british_5stars_phone: 2
resto_bombay_cheap_french_7stars_phone: 2
resto_bombay_cheap_french_7stars_address: 2
resto_bombay_moderate_italian_6stars: 5
resto_bombay_moderate_italian_5stars: 5
resto_bombay_moderate_italian_4stars: 4
resto_bombay_moderate_italian_4stars_address: 2
resto_rome_moderate_spanish_3stars: 6
resto_rome_moderate_spanish_3stars_address: 2
resto_paris_expensive_french_2stars_address: 1
resto_london_cheap_british_4stars_address: 4
resto_london_expensive_british_7stars: 13
resto_london_expensive_british_1stars: 6
resto_london_expensive_british_1stars_address: 6
resto_bombay_moderate_french_5stars_phone: 3
resto_bombay_moderate_british_1stars_phone: 2
resto_london_expensive_british_1stars_phone: 4
resto_london_cheap_spanish_8stars_phone: 2
resto_paris_moderate_indian_8stars_address: 3
resto_bombay_moderate_italian_2stars: 2
resto_bombay_moderate_italian_2stars_address: 2
resto_bombay_moderate_spanish_1stars: 5
resto_bombay_moderate_spanish_1stars_phone: 4
resto_bombay_moderate_spanish_1stars_address: 4
resto_bombay_expensive_spanish_8stars_phone: 7
resto_london_moderate_indian_2stars: 4
resto_london_moderate_indian_2stars_address: 1
resto_london_cheap_british_6stars_address: 1
resto_london_cheap_british_6stars_phone: 1
resto_london_cheap_spanish_7stars_phone: 1
resto_madrid_cheap_italian_4stars_address: 1
resto_madrid_cheap_italian_4stars_phone: 2
resto_bombay_expensive_italian_4stars_phone: 1
resto_paris_expensive_spanish_6stars_address: 1
resto_bombay_cheap_spanish_8stars_phone: 3
resto_bombay_cheap_spanish_8stars_address: 3
resto_madrid_cheap_british_3stars: 3
resto_madrid_cheap_british_1stars: 3
resto_madrid_cheap_british_1stars_address: 3
resto_madrid_cheap_british_1stars_phone: 2
resto_paris_cheap_french_7stars: 6
resto_paris_cheap_french_7stars_phone: 2
resto_rome_expensive_italian_3stars: 6
resto_rome_expensive_italian_3stars_address: 3
resto_paris_cheap_british_6stars_address: 1
resto_paris_expensive_spanish_6stars_phone: 1
resto_paris_cheap_spanish_7stars_address: 2
resto_london_expensive_spanish_3stars_address: 1
resto_london_moderate_british_6stars_phone: 1
resto_london_moderate_british_6stars_address: 1
resto_madrid_moderate_british_5stars_phone: 2
resto_madrid_moderate_british_5stars_address: 2
resto_rome_expensive_italian_3stars_phone: 2
resto_bombay_expensive_british_8stars_phone: 3
resto_bombay_expensive_british_8stars_address: 2
resto_bombay_cheap_indian_4stars_phone: 1
resto_bombay_cheap_indian_4stars_address: 1
resto_madrid_moderate_french_6stars_address: 2
resto_madrid_moderate_french_6stars_phone: 3
resto_rome_cheap_indian_5stars_address: 3
resto_bombay_expensive_indian_1stars: 4
resto_bombay_expensive_indian_1stars_phone: 3
resto_bombay_expensive_indian_1stars_address: 3
resto_rome_moderate_spanish_2stars: 3
resto_rome_moderate_spanish_2stars_phone: 3
resto_paris_cheap_french_8stars_phone: 2
resto_paris_cheap_french_8stars_address: 2
resto_madrid_moderate_british_7stars_address: 1
resto_london_cheap_british_4stars_phone: 3
resto_paris_expensive_italian_4stars_address: 3
resto_london_cheap_italian_6stars_address: 1
resto_london_cheap_italian_6stars_phone: 1
resto_rome_expensive_indian_6stars_phone: 3
resto_bombay_moderate_italian_5stars_phone: 1
resto_london_moderate_indian_5stars_address: 1
resto_london_cheap_british_1stars: 4
resto_london_cheap_british_1stars_address: 3
resto_paris_moderate_british_1stars_phone: 5
resto_rome_moderate_indian_3stars_address: 2
resto_london_cheap_british_1stars_phone: 3
resto_paris_cheap_british_8stars_phone: 1
resto_london_moderate_french_3stars_phone: 2
resto_rome_moderate_spanish_2stars_address: 2
resto_madrid_moderate_british_7stars_phone: 1
resto_rome_cheap_indian_6stars_phone: 3
resto_london_cheap_italian_5stars_address: 3
resto_bombay_cheap_italian_4stars_phone: 2
resto_bombay_moderate_french_5stars_address: 1
resto_paris_moderate_british_3stars_phone: 3
resto_paris_moderate_british_3stars_address: 3
resto_paris_expensive_italian_4stars_phone: 2
resto_madrid_moderate_italian_7stars_address: 1
resto_madrid_moderate_italian_7stars_phone: 1
resto_rome_expensive_british_8stars_address: 2
resto_rome_expensive_british_8stars_phone: 1
resto_paris_expensive_spanish_4stars_address: 1
resto_madrid_cheap_spanish_8stars_phone: 2
resto_madrid_cheap_spanish_8stars_address: 3
resto_london_cheap_british_5stars_address: 3
resto_london_expensive_indian_2stars_address: 2
resto_london_expensive_british_7stars_address: 5
resto_london_expensive_british_7stars_phone: 6
resto_madrid_expensive_italian_4stars_phone: 3
resto_madrid_expensive_italian_4stars_address: 4
resto_rome_expensive_spanish_6stars_address: 2
resto_london_cheap_british_5stars_phone: 4
resto_london_moderate_spanish_6stars: 8
resto_london_moderate_spanish_6stars_address: 2
resto_london_moderate_spanish_6stars_phone: 2
resto_bombay_moderate_british_3stars: 6
resto_bombay_moderate_british_3stars_phone: 3
resto_paris_cheap_italian_6stars_phone: 2
resto_paris_cheap_italian_6stars_address: 5
resto_london_moderate_spanish_3stars: 5
resto_london_moderate_spanish_3stars_address: 2
resto_london_moderate_spanish_2stars: 3
resto_london_moderate_spanish_2stars_phone: 3
resto_london_moderate_spanish_2stars_address: 2
resto_madrid_expensive_italian_7stars_phone: 1
resto_madrid_moderate_french_7stars_phone: 2
resto_madrid_moderate_british_6stars_address: 2
resto_paris_expensive_spanish_5stars_address: 2
resto_rome_moderate_french_2stars_address: 2
resto_paris_cheap_italian_2stars_address: 1
resto_bombay_moderate_spanish_8stars_phone: 2
resto_london_expensive_indian_2stars_phone: 1
resto_bombay_expensive_spanish_1stars_address: 1
resto_madrid_cheap_indian_6stars_address: 3
resto_london_expensive_italian_6stars: 4
resto_london_expensive_italian_3stars: 2
resto_london_expensive_italian_3stars_address: 2
resto_london_expensive_italian_3stars_phone: 2
resto_paris_cheap_spanish_4stars_phone: 4
resto_london_expensive_italian_6stars_phone: 2
resto_london_expensive_italian_6stars_address: 1
resto_london_moderate_italian_7stars_address: 2
resto_london_moderate_french_3stars_address: 1
resto_rome_cheap_indian_7stars_phone: 2
resto_rome_cheap_indian_7stars_address: 2
resto_paris_moderate_italian_6stars_address: 2
resto_bombay_moderate_french_6stars_phone: 2
resto_madrid_cheap_italian_8stars_address: 2
resto_rome_expensive_italian_1stars: 3
resto_rome_expensive_italian_1stars_address: 3
resto_rome_expensive_italian_1stars_phone: 2
resto_london_moderate_italian_7stars_phone: 1
resto_madrid_cheap_british_2stars: 3
resto_madrid_cheap_british_2stars_phone: 2
resto_rome_cheap_indian_6stars_address: 2
resto_paris_moderate_french_3stars_address: 2
resto_rome_moderate_spanish_5stars_address: 1
resto_london_moderate_british_5stars_address: 2
resto_madrid_cheap_italian_5stars_address: 2
resto_rome_expensive_spanish_7stars_phone: 2
resto_madrid_cheap_french_8stars_address: 1
resto_madrid_expensive_indian_7stars_address: 1
resto_madrid_expensive_indian_7stars_phone: 1
resto_paris_expensive_french_8stars_address: 3
resto_london_moderate_british_1stars: 2
resto_london_moderate_british_1stars_address: 2
resto_london_moderate_british_1stars_phone: 2
resto_bombay_moderate_british_8stars_phone: 2
resto_bombay_moderate_british_8stars_address: 3
resto_rome_expensive_british_5stars_address: 1
resto_london_expensive_indian_6stars_address: 2
resto_london_expensive_indian_6stars_phone: 1
resto_london_moderate_indian_1stars: 2
resto_london_moderate_indian_1stars_address: 2
resto_madrid_moderate_british_4stars_address: 2
resto_rome_moderate_indian_7stars_phone: 1
resto_london_cheap_french_7stars_address: 2
resto_london_cheap_french_7stars_phone: 2
resto_london_expensive_spanish_8stars_address: 2
resto_london_expensive_spanish_8stars_phone: 3
resto_paris_moderate_british_2stars_address: 1
resto_madrid_cheap_indian_6stars_phone: 1
resto_madrid_moderate_british_6stars_phone: 2
resto_london_moderate_indian_1stars_phone: 1
resto_london_moderate_italian_4stars: 2
resto_london_moderate_italian_4stars_address: 1
resto_london_moderate_italian_4stars_phone: 1
resto_rome_expensive_french_4stars: 4
resto_rome_expensive_french_1stars: 2
resto_rome_expensive_french_1stars_address: 2
resto_rome_expensive_french_1stars_phone: 2
resto_paris_cheap_british_6stars_phone: 1
resto_madrid_moderate_italian_6stars_address: 1
resto_bombay_cheap_indian_7stars_address: 1
resto_madrid_cheap_italian_6stars_phone: 1
resto_london_moderate_italian_3stars: 1
resto_london_moderate_italian_3stars_phone: 1
resto_london_moderate_italian_3stars_address: 1
resto_rome_moderate_spanish_3stars_phone: 1
resto_paris_moderate_spanish_4stars_address: 1
resto_madrid_moderate_french_3stars_address: 2
resto_bombay_cheap_italian_8stars_phone: 2
resto_paris_expensive_british_3stars_phone: 1
resto_paris_expensive_british_3stars_address: 1
resto_london_expensive_british_2stars_phone: 2
resto_rome_moderate_indian_3stars_phone: 1
resto_bombay_cheap_italian_2stars_phone: 1
resto_bombay_cheap_italian_2stars_address: 1
resto_rome_cheap_french_6stars_address: 3
resto_rome_cheap_french_6stars_phone: 3
resto_madrid_expensive_spanish_6stars_phone: 2
resto_bombay_moderate_british_2stars: 3
resto_bombay_moderate_british_2stars_address: 2
resto_bombay_moderate_british_2stars_phone: 2
resto_paris_expensive_indian_7stars_phone: 2
resto_bombay_expensive_british_3stars_address: 1
resto_bombay_expensive_british_3stars_phone: 1
resto_rome_cheap_british_4stars_address: 2
resto_rome_cheap_british_4stars_phone: 1
resto_madrid_expensive_italian_7stars_address: 1
resto_paris_expensive_italian_6stars: 1
resto_paris_expensive_italian_5stars: 1
resto_paris_expensive_italian_5stars_address: 1
resto_paris_expensive_italian_5stars_phone: 1
resto_rome_moderate_british_2stars_phone: 1
resto_paris_cheap_french_6stars: 3
resto_paris_cheap_french_4stars: 3
resto_paris_cheap_french_3stars: 3
resto_paris_cheap_french_3stars_address: 3
resto_paris_cheap_french_3stars_phone: 2
resto_london_cheap_italian_2stars_phone: 1
resto_paris_cheap_spanish_7stars_phone: 1
resto_london_moderate_indian_2stars_phone: 1
resto_madrid_moderate_british_4stars_phone: 1
resto_madrid_moderate_french_3stars_phone: 1
resto_bombay_expensive_italian_2stars_phone: 2
resto_rome_moderate_italian_5stars_address: 2
resto_rome_moderate_italian_5stars_phone: 3
resto_rome_expensive_spanish_6stars_phone: 1
resto_madrid_expensive_french_3stars_address: 1
resto_madrid_expensive_french_3stars_phone: 1
resto_paris_cheap_french_7stars_address: 2
resto_bombay_moderate_french_7stars_address: 1
resto_madrid_expensive_spanish_5stars_phone: 2
resto_madrid_cheap_british_2stars_address: 2
resto_london_expensive_french_3stars_phone: 1
resto_london_expensive_french_3stars_address: 1
resto_madrid_expensive_french_7stars_phone: 1
resto_madrid_expensive_french_7stars_address: 1
resto_bombay_moderate_indian_3stars_phone: 2
resto_rome_cheap_british_5stars_phone: 1
resto_bombay_moderate_british_6stars_phone: 1
resto_london_cheap_british_3stars_address: 2
resto_bombay_expensive_spanish_5stars_address: 1
resto_madrid_cheap_british_7stars_address: 1
resto_rome_expensive_french_8stars_phone: 1
resto_madrid_moderate_french_7stars_address: 1
resto_rome_expensive_french_4stars_phone: 2
resto_bombay_cheap_french_4stars_phone: 1
resto_bombay_cheap_french_4stars_address: 1
resto_paris_cheap_spanish_6stars_address: 1
resto_paris_cheap_spanish_6stars_phone: 1
resto_paris_moderate_spanish_5stars_phone: 1
resto_london_expensive_spanish_6stars_phone: 1
resto_bombay_moderate_british_3stars_address: 2
resto_bombay_cheap_spanish_7stars_phone: 1
resto_bombay_cheap_spanish_7stars_address: 1
resto_rome_moderate_indian_7stars_address: 1
resto_madrid_expensive_british_1stars_address: 1
resto_london_expensive_british_4stars_phone: 1
resto_london_expensive_british_4stars_address: 1
resto_bombay_moderate_british_6stars_address: 1
resto_bombay_cheap_italian_3stars_phone: 1
resto_bombay_moderate_french_8stars_address: 1
resto_rome_expensive_french_8stars_address: 1
resto_madrid_expensive_spanish_5stars_address: 1
resto_paris_expensive_indian_7stars_address: 1
resto_london_expensive_french_6stars_address: 1
resto_bombay_moderate_french_8stars_phone: 1
resto_rome_cheap_italian_6stars_phone: 1
resto_rome_expensive_french_4stars_address: 1
resto_bombay_moderate_italian_4stars_phone: 1
resto_paris_expensive_british_5stars_address: 1
resto_paris_expensive_british_5stars_phone: 1